SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-67719T-L1T-B

Comment( LNER L1 2-6-4 Tank Engine )
Comment( FLIPPED FOR RETURN ROUTE - CHANGE CABS CTRL #E ) 

Type ( Engine )
WagonShape ( DR_BR_L1_67719.s )
Size  ( 2.727027m 4.005943m 13.097692m )
Mass ( 89.45t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 20cm 0cm )
              )
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 245kN ) Comment(53% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 89kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)    

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 6529 )
ORTSDavis_B ( 29.91 )
ORTSDavis_C ( 5.235 )

ORTSWagonFrontalArea (98ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 4
			Light	(
			comment( Front White Lamp Position A )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.33 5.54 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
			Light	(
			comment( Rear White Lamp Reversed Position A )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 5 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 2.52 -6.28 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
			Light	(
			comment( Rear Red Lamp Position A )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 3 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 2.52 -6.28 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Reversed Position A )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 3.33 5.54 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		)
	
	
Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

FreightAnim ( DR_BR_L1_Extras.s -0.1 0.1 )


Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( DR_BR_L1_67719.s )
        PassengerCabinHeadPos ( 1.455 2.95 -2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)


Engine ( OR-67719T-L1T-B
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
			0.269 3.8 -1.214
			0 1 0
			0.2
			)
			SafetyValvesFX
			(
			0 3.772 -0.67
			0 1 0
			0.3
			)
			StackFX
			(
			0 4.000 4.418
			0 1 0
			0.5
			)
			CylindersFX
			(
			-1.026 0.318 4.876
			0 0 1
			0.13
			)
			CylindersFX
			(
			1.026 0.318 4.876
			0 0 1
			0.13
			)
			Injectors2FX
			(
			-1.026 0.1 -2.5
			0 -1 -1
			0.15
			)
			Injectors1FX
			(
			1.026 0.1 -2.5
			0 -1 1
			0.15
			)
		)
	)

Wagon ( OR-67719T-L1T-B )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 31in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 60t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 177ft^3 ) 
ORTSEvaporationArea ( 1336.5ft^2 )
ORTSSuperheatArea ( 284ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 24.74ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 4.5t-uk )
MaxTenderWaterMass ( 26300lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15 )

Comment(ORTSMaxIndicatedHorsepower ( 1100.0hp )) 

ORTSMaxSuperheatTemperature ( 250.0 )

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 ) Comment(From Pawson Graph)

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

Comment ( *********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

	Cabview ( L1Tank.cvf )
	HeadOut (  -1.455 2.95 -2 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
    	Name ( "67719 L1 Tank, Local, Kings Cross Shed, Coal 4.5t, Water 2630gal,\n"+ " Reverse Cab, TE 32Klbf" )
 	Description (
 	"Thirty new L1 locomotives were authorised in April 1944, and the first locomotive (No. 9000) was completed in May 1945. This was the only tank engine built by the LNER that was painted in lined apple-green livery. The LNER's 1945 Modernisation Plan included a total of 110 locomotives, including No. 9000. Although the first order was placed in 1944, No. 9000 would remain the only L1 in service until Nationalisation in 1948. In 1948, Darlington built the remaining twenty nine locomotives from the original order of thirty. The plan for 110 was eventually reduced to 100, with the remaining 70 built by the North British Locomotive Co. and Robert Stephenson & Hawthorn, between 1948 and 1950.\n"+
"\n"+
"After trials, No. 9000 ran for a few months in the Edinburgh area before entering service at Stratford. The first batch of twenty nine product L1s were allocated to Stratford, Neasden, and Botanic Gardens (Hull). Six of the next seventy were allocated to Eastfield for use in Scotland. However, their routes were restricted by electrification in the Glasgow area and they were sent to Eastfield in exchange for V1 and V3 2-6-2Ts. After all one hundred L1s were delivered at the end of 1950, they were concentrated at Stratford, Neasden, and Ipswich; with smaller numbers at Kings Cross, Hornsey, Hitchin, Norwich, Lowestoft, Darlington, and Botanic Gardens. This would be the basic distribution until the first diesel multiple units were introduced in 1955.\n"+
"\n"+
"The L1s generally hauled passenger services in the areas operated by these sheds. Suburban and stopping passenger services were the most common, but occasionally they would haul express services, as well as some freight and colliery traffic. Over time they would replace older tank locomotives such as F5 2-4-2Ts, F6 2-4-2Ts, C12 4-4-2Ts, and G5 0-4-4Ts; and were in turn displaced by diesel multiple units and electrification."
)
)
